inha-fc/inhaino-esp32cam/CameraWebServer/app_httpd.cpp
  if (!fb) {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");

  char ts[32];
  // Cast to uint32_t is safe until year 2106.
  snprintf(ts, 32, "%" PRIu32 ".%06" PRIu32, (uint32_t)fb->timestamp.tv_sec, (uint32_t)fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  size_t fb_len = 0;
#endif
  if (fb->format == PIXFORMAT_JPEG) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = fb->len;
#endif
    res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
  } else {
    jpg_chunking_t jchunk = {req, 0};
    res = frame2jpg_cb(fb, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
    httpd_resp_send_chunk(req, NULL, 0);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = jchunk.len;
#endif
  }
  esp_camera_fb_return(fb);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_end = esp_timer_get_time();
#endif
  log_i("JPG: %" PRIu32 "B %" PRId32 " ms", (uint32_t)fb_len, (int32_t)((fr_end - fr_start) / 1000));
  return res;
}

static esp_err_t stream_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  struct timeval _timestamp;
  esp_err_t res = ESP_OK;
  size_t _jpg_buf_len = 0;
  uint8_t *_jpg_buf = NULL;
  char *part_buf[128];

  static int64_t last_frame = 0;
  if (!last_frame) {
    last_frame = esp_timer_get_time();
  }

  res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
  if (res != ESP_OK) {
    return res;
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "X-Framerate", "60");

#if defined(LED_GPIO_NUM)
  isStreaming = true;
  enable_led(true);
#endif

  while (true) {
    fb = esp_camera_fb_get();
    if (!fb) {
      log_e("Camera capture failed");
      res = ESP_FAIL;
    } else {
      _timestamp.tv_sec = fb->timestamp.tv_sec;
      _timestamp.tv_usec = fb->timestamp.tv_usec;
      if (fb->format != PIXFORMAT_JPEG) {
        bool jpeg_converted = frame2jpg(fb, 80, &_jpg_buf, &_jpg_buf_len);
        esp_camera_fb_return(fb);
        fb = NULL;
        if (!jpeg_converted) {
          log_e("JPEG compression failed");
          res = ESP_FAIL;
        }
      } else {
        _jpg_buf_len = fb->len;
        _jpg_buf = fb->buf;
      }
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
    }
    if (res == ESP_OK) {
      size_t hlen = snprintf((char *)part_buf, 128, _STREAM_PART, _jpg_buf_len, _timestamp.tv_sec, _timestamp.tv_usec);
      res = httpd_resp_send_chunk(req, (const char *)part_buf, hlen);
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);
    }
    if (fb) {
      esp_camera_fb_return(fb);
      fb = NULL;
      _jpg_buf = NULL;
    } else if (_jpg_buf) {
      free(_jpg_buf);
      _jpg_buf = NULL;
    }
    if (res != ESP_OK) {
      log_e("Send frame failed");
      break;
    }
    int64_t fr_end = esp_timer_get_time();

    int64_t frame_time = fr_end - last_frame;
    last_frame = fr_end;

    frame_time /= 1000;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    uint32_t avg_frame_time = ra_filter_run(&ra_filter, frame_time);
#endif
    log_i(
      "MJPG: %" PRIu32 "B %" PRId32 "ms (%.1ffps), AVG: %" PRIu32 "ms (%.1ffps)", (uint32_t)_jpg_buf_len, (int32_t)frame_time, 1000.0 / frame_time,
      avg_frame_time, 1000.0 / avg_frame_time
    );
  }

#if defined(LED_GPIO_NUM)
  isStreaming = false;
  enable_led(false);
#endif

  return res;
}

static esp_err_t parse_get(httpd_req_t *req, char **obuf) {
  char *buf = NULL;
  size_t buf_len = 0;

  buf_len = httpd_req_get_url_query_len(req) + 1;
  if (buf_len > 1) {
    buf = (char *)malloc(buf_len);
    if (!buf) {
      httpd_resp_send_500(req);
      return ESP_FAIL;
    }
    if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
      *obuf = buf;
      return ESP_OK;
    }
    free(buf);
  }
  httpd_resp_send_404(req);
  return ESP_FAIL;
}

int camera_apply_control(const char *variable, int val) {
  sensor_t *s = esp_camera_sensor_get();
  if (!s) return -1;

#if defined(LED_GPIO_NUM)
  if (!strcmp(variable, "led_intensity")) {
    led_duty = val;
    if (isStreaming) enable_led(true);
    return 0;
  }
#endif

  if (!strcmp(variable, "framesize")) {
    if (s->pixformat == PIXFORMAT_JPEG)
      return s->set_framesize(s, (framesize_t)val);
    return 0;
  } else if (!strcmp(variable, "quality")) {
    return s->set_quality(s, val);
  } else if (!strcmp(variable, "contrast")) {
    return s->set_contrast(s, val);
  } else if (!strcmp(variable, "brightness")) {
    return s->set_brightness(s, val);
  } else if (!strcmp(variable, "saturation")) {
    return s->set_saturation(s, val);
  } else if (!strcmp(variable, "gainceiling")) {
    return s->set_gainceiling(s, (gainceiling_t)val);
  } else if (!strcmp(variable, "colorbar")) {
    return s->set_colorbar(s, val);
  } else if (!strcmp(variable, "awb")) {
    return s->set_whitebal(s, val);
  } else if (!strcmp(variable, "agc")) {
    return s->set_gain_ctrl(s, val);
  } else if (!strcmp(variable, "aec")) {
    return s->set_exposure_ctrl(s, val);
  } else if (!strcmp(variable, "hmirror")) {
    return s->set_hmirror(s, val);
  } else if (!strcmp(variable, "vflip")) {
    return s->set_vflip(s, val);
  } else if (!strcmp(variable, "awb_gain")) {
    return s->set_awb_gain(s, val);
  } else if (!strcmp(variable, "agc_gain")) {
    return s->set_agc_gain(s, val);
  } else if (!strcmp(variable, "aec_value")) {
    return s->set_aec_value(s, val);
  } else if (!strcmp(variable, "aec2")) {
    return s->set_aec2(s, val);
  } else if (!strcmp(variable, "dcw")) {
    return s->set_dcw(s, val);
  } else if (!strcmp(variable, "bpc")) {
    return s->set_bpc(s, val);
  } else if (!strcmp(variable, "wpc")) {
    return s->set_wpc(s, val);
  } else if (!strcmp(variable, "raw_gma")) {
    return s->set_raw_gma(s, val);
  } else if (!strcmp(variable, "lenc")) {
    return s->set_lenc(s, val);
  } else if (!strcmp(variable, "special_effect")) {
    return s->set_special_effect(s, val);
  } else if (!strcmp(variable, "wb_mode")) {
    return s->set_wb_mode(s, val);
  } else if (!strcmp(variable, "ae_level")) {
    return s->set_ae_level(s, val);
  }
  log_i("Unknown command: %s", variable);
  return -1;
}

static esp_err_t cmd_handler(httpd_req_t *req) {
  if (!check_auth(req)) {
    return reject_auth(req);
  }
  char *buf = NULL;
  char variable[32];
  char value[32];

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }
  if (httpd_query_key_value(buf, "var", variable, sizeof(variable)) != ESP_OK || httpd_query_key_value(buf, "val", value, sizeof(value)) != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

