inha-fc/inhaino-esp32cam/CameraWebServer/app_httpd.cpp
static esp_err_t update_upload_handler(httpd_req_t *req) {
  if (!check_auth(req)) return reject_auth(req);

  int content_len = req->content_len;
  if (content_len <= 0) {
    httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Content-Length required");
    return ESP_FAIL;
  }
  if (!Update.begin((size_t)content_len)) {
    log_e("OTA begin failed: %s", Update.errorString());
    return httpd_resp_send_500(req);
  }

  uint8_t buf[1024];
  int remaining = content_len;
  while (remaining > 0) {
    int chunk = remaining < (int)sizeof(buf) ? remaining : (int)sizeof(buf);
    int got = httpd_req_recv(req, (char *)buf, chunk);
    if (got <= 0 || Update.write(buf, got) != (size_t)got) {
      Update.abort();
      return httpd_resp_send_500(req);
    }
    remaining -= got;
  }
  if (!Update.end(true)) {
    log_e("OTA end failed: %s", Update.errorString());
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_type(req, "application/json");
  httpd_resp_send(req, "{\"result\":\"ok\",\"note\":\"restarting\"}", -1);
  vTaskDelay(500 / portTICK_PERIOD_MS);
  esp_restart();
  return ESP_OK;
}

// ── InhaIno endpoints (HTTP port 81, no auth) ─────────────────────────────────
// R4WiFi uses plain WiFiClient (no SSL), so these live on the HTTP stream server.
//
// Flow:
//   R4WiFi  →  GET :81/inhaino/capture  →  {"img_url":"http://<ip>:81/inhaino/jpeg"}
//   Server  →  GET :81/inhaino/jpeg     →  binary JPEG  →  face match

static esp_err_t inhaino_jpeg_handler(httpd_req_t *req) {
  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Cache-Control", "no-cache");
  esp_err_t res;
  if (fb->format == PIXFORMAT_JPEG) {
    res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
  } else {
    jpg_chunking_t jchunk = {req, 0};
    res = frame2jpg_cb(fb, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
    httpd_resp_send_chunk(req, NULL, 0);
  }
  esp_camera_fb_return(fb);
  log_i("InhaIno JPEG served");
  return res;
}

static esp_err_t inhaino_capture_handler(httpd_req_t *req) {
  // Flush one stale frame so the next capture is fresh.
  camera_fb_t *fb = esp_camera_fb_get();
  if (fb) esp_camera_fb_return(fb);

  char json[128];
  snprintf(json, sizeof(json),
           "{\"img_url\":\"http://%s:81/inhaino/jpeg\"}",
           WiFi.localIP().toString().c_str());

  log_i("InhaIno capture trigger → %s", json);
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Cache-Control", "no-cache");
  return httpd_resp_send(req, json, strlen(json));
}

void startCameraServer() {
  // Load TLS certificate from NVS; fall back to embedded default.
  char *nvs_cert = NULL, *nvs_key = NULL;
  bool has_nvs = tls_load_nvs(&nvs_cert, &nvs_key);
  const char *active_cert = has_nvs ? nvs_cert : DEFAULT_CERT_PEM;
  const char *active_key  = has_nvs ? nvs_key  : DEFAULT_KEY_PEM;

  httpd_ssl_config_t ssl_cfg = HTTPD_SSL_CONFIG_DEFAULT();
  ssl_cfg.httpd.max_uri_handlers = 20;
  ssl_cfg.httpd.ctrl_port = 32768;
  ssl_cfg.port_secure      = 443;
  ssl_cfg.servercert       = (const uint8_t *)active_cert;
  ssl_cfg.servercert_len   = strlen(active_cert) + 1;
  ssl_cfg.prvtkey_pem      = (const uint8_t *)active_key;
  ssl_cfg.prvtkey_len      = strlen(active_key) + 1;

  httpd_uri_t index_uri = {
    .uri = "/",
    .method = HTTP_GET,
    .handler = index_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t status_uri = {
    .uri = "/status",
    .method = HTTP_GET,
    .handler = status_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t cmd_uri = {
    .uri = "/control",
    .method = HTTP_GET,
    .handler = cmd_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t capture_uri = {
    .uri = "/capture",
    .method = HTTP_GET,
    .handler = capture_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t stream_uri = {
    .uri = "/stream",
    .method = HTTP_GET,
    .handler = stream_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t bmp_uri = {
    .uri = "/bmp",
    .method = HTTP_GET,
    .handler = bmp_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t xclk_uri = {
    .uri = "/xclk",
    .method = HTTP_GET,
    .handler = xclk_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t reg_uri = {
    .uri = "/reg",
    .method = HTTP_GET,
    .handler = reg_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t greg_uri = {
    .uri = "/greg",
    .method = HTTP_GET,
    .handler = greg_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t pll_uri = {
    .uri = "/pll",
    .method = HTTP_GET,
    .handler = pll_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

