inha-fc/inhaino-esp32cam/CameraWebServer/app_httpd.cpp
  httpd_uri_t win_uri = {
    .uri = "/resolution",
    .method = HTTP_GET,
    .handler = win_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t cert_uri = {
    .uri = "/cert", .method = HTTP_POST, .handler = cert_handler, .user_ctx = NULL
  };
  httpd_uri_t certkey_uri = {
    .uri = "/cert/key", .method = HTTP_POST, .handler = cert_handler, .user_ctx = NULL
  };
  httpd_uri_t restart_uri = {
    .uri = "/restart", .method = HTTP_POST, .handler = restart_handler, .user_ctx = NULL
  };
  httpd_uri_t info_uri = {
    .uri = "/info", .method = HTTP_GET, .handler = info_handler, .user_ctx = NULL
  };
  httpd_uri_t update_page_uri = {
    .uri = "/update", .method = HTTP_GET, .handler = update_page_handler, .user_ctx = NULL
  };
  httpd_uri_t update_upload_uri = {
    .uri = "/update", .method = HTTP_POST, .handler = update_upload_handler, .user_ctx = NULL
  };

  ra_filter_init(&ra_filter, 20);

  log_i("Starting HTTPS server on port 443");
  if (httpd_ssl_start(&camera_httpd, &ssl_cfg) == ESP_OK) {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &bmp_uri);
    httpd_register_uri_handler(camera_httpd, &xclk_uri);
    httpd_register_uri_handler(camera_httpd, &reg_uri);
    httpd_register_uri_handler(camera_httpd, &greg_uri);
    httpd_register_uri_handler(camera_httpd, &pll_uri);
    httpd_register_uri_handler(camera_httpd, &win_uri);
    httpd_register_uri_handler(camera_httpd, &cert_uri);
    httpd_register_uri_handler(camera_httpd, &certkey_uri);
    httpd_register_uri_handler(camera_httpd, &restart_uri);
    httpd_register_uri_handler(camera_httpd, &info_uri);
    httpd_register_uri_handler(camera_httpd, &update_page_uri);
    httpd_register_uri_handler(camera_httpd, &update_upload_uri);
  }

  if (has_nvs) { free(nvs_cert); free(nvs_key); }

  // Stream server stays on plain HTTP (SSL overhead is too high for MJPEG).
  httpd_uri_t inhaino_capture_uri = {
    .uri = "/inhaino/capture", .method = HTTP_GET,
    .handler = inhaino_capture_handler, .user_ctx = NULL
  };
  httpd_uri_t inhaino_jpeg_uri = {
    .uri = "/inhaino/jpeg", .method = HTTP_GET,
    .handler = inhaino_jpeg_handler, .user_ctx = NULL
  };

  httpd_config_t stream_cfg = HTTPD_DEFAULT_CONFIG();
  stream_cfg.server_port      = 81;
  stream_cfg.ctrl_port        = 32769;
  stream_cfg.max_uri_handlers = 4;  // stream + inhaino_capture + inhaino_jpeg + spare
  log_i("Starting stream server on port 81 (HTTP)");
  if (httpd_start(&stream_httpd, &stream_cfg) == ESP_OK) {
    httpd_register_uri_handler(stream_httpd, &stream_uri);
    httpd_register_uri_handler(stream_httpd, &inhaino_capture_uri);
    httpd_register_uri_handler(stream_httpd, &inhaino_jpeg_uri);
  }
}

void setupLedFlash() {
#if defined(LED_GPIO_NUM)
  ledcAttach(LED_GPIO_NUM, 5000, 8);
#else
  log_i("LED flash is disabled -> LED_GPIO_NUM undefined");
#endif
}
